package lk.tech.fourteen.set;

import java.util.TreeSet;
import java.util.concurrent.atomic.AtomicInteger;

/*
ТЗ:
Смоделювати таблицю результатів забігу.

Вимоги:
1. Результати спортсменів зберігаються у відсортованому вигляді.
2. Кожен результат унікальний (однакові значення не допускаються).
3. Потрібно показати:
   - додавання результатів
   - автоматичне сортування
   - перевірку наявності результату
   - отримання найкращого та найгіршого результату
   - перебір всіх результатів
   - видалення результату
*/

public class MainTreeSet {

    public static void main(String[] args) {


    }
}